#pragma once

// -------------------------------------------------------------------------------
// Includes
// -------------------------------------------------------------------------------

// -------------------------------------------------------------------------------
// Forward Declarations
// -------------------------------------------------------------------------------
class DescriptorHandle;
class DescriptorPool;

// -------------------------------------------------------------------------------
// ColorTarget class
// -------------------------------------------------------------------------------
class ColorTarget
{
public:

	// -------------------------------------------------------------------------------
	// @brief	コンストラクタ
	// -------------------------------------------------------------------------------
	ColorTarget();

	// -------------------------------------------------------------------------------
	// @brief	デストラクタ
	// -------------------------------------------------------------------------------
	~ColorTarget();

	// -------------------------------------------------------------------------------
	// @brief	初期化処理
	// 
	// @param[in]	pDevice		デバイス
	// @param[in]	pPoolDSV	ディスクリプタプール
	// @param[in]	width		横幅
	// @param[in]	height		縦幅
	// @param[in]	format		ピクセルフォーマット
	// @retval	true	初期化に成功
	// @retval	false	初期化に失敗
	// -------------------------------------------------------------------------------
	bool Init(
		ID3D12Device* _pDevice,
		DescriptorPool* _pPoolDSV,
		uint32_t		_width,
		uint32_t		_height,
		DXGI_FORMAT		_format);

	// -------------------------------------------------------------------------------
	// @brief	バックバッファから初期化処理
	// 
	// @param[in]	pDevice		デバイス
	// @param[in]	pPoolRTV	ディスクリプタプール
	// @param[in]	index		バックバッファ番号
	// @param[in]	pSwapChain	スワップチェイン
	// @retval	true	初期化に成功
	// @retval	false	初期化に失敗
	// -------------------------------------------------------------------------------
	bool InitFromBackBuffer(
		ID3D12Device*	_pDevice,
		DescriptorPool* _pPoolRTV,
		uint32_t		_index,
		IDXGISwapChain* _pSwapChain);

	// -------------------------------------------------------------------------------
	// @brief	終了処理
	// -------------------------------------------------------------------------------
	void Term();

	// -------------------------------------------------------------------------------
	// @brief	ディスクリプタハンドル（RTV用）を取得
	// 
	// @return	ディスクリプタハンドル（RTV用）を返却
	// -------------------------------------------------------------------------------
	DescriptorHandle* GetHandleRTV() const;

	// -------------------------------------------------------------------------------
	// @brief	リソースを取得
	// 
	// @return	リソースを返却
	// -------------------------------------------------------------------------------
	ID3D12Resource* GetResource() const;

	// -------------------------------------------------------------------------------
	// @brief	リソース設定を取得
	// 
	// @return	リソース設定を返却
	// -------------------------------------------------------------------------------
	D3D12_RESOURCE_DESC GetDesc() const;

	// -------------------------------------------------------------------------------
	// @brief	レンダーターゲットビューの設定を取得
	// 
	// @return	レンダーターゲットビューの設定を返却
	// -------------------------------------------------------------------------------
	D3D12_RENDER_TARGET_VIEW_DESC GetViewDesc() const;

private:

	// -------------------------------------------------------------------------------
	// private variables
	// -------------------------------------------------------------------------------
	ComPtr<ID3D12Resource>			m_pTarget;		// リソース
	DescriptorHandle*				m_pHandleRTV;	// ディスクリプタハンドル（DSV用）
	DescriptorPool*					m_pPoolRTV;		// ディスクリプタプール（DSV用）
	D3D12_RENDER_TARGET_VIEW_DESC	m_ViewDesc;		// レンダーターゲットビューの設定

	// -------------------------------------------------------------------------------
	// private methods
	// -------------------------------------------------------------------------------
	ColorTarget		(const ColorTarget&) = delete;
	void operator = (const ColorTarget&) = delete;
};
