// -------------------------------------------------------------------------------
// Includes
// -------------------------------------------------------------------------------
#include "CameraBase.h"
#include <Engine/Utility/Debug/Logger/Logger.h>

// -------------------------------------------------------------------------------
//		コンストラクタ
// -------------------------------------------------------------------------------
CameraBase::CameraBase() 
{ /* DO_NOTHING */ }

// -------------------------------------------------------------------------------
//		デストラクタ
// -------------------------------------------------------------------------------
CameraBase::~CameraBase()
{ /* DO_NOTHING */ }

// -------------------------------------------------------------------------------
//		FOVの変更
// -------------------------------------------------------------------------------

void CameraBase::SetFov(float _fovDeg)
{
	m_Fov = _fovDeg;
	UpdateProj();
}

void CameraBase::SetAspect(float _aspect)
{
	m_Aspect = _aspect;
	UpdateProj();
}

void CameraBase::SetNearFar(float _near, float _far)
{
	m_Near	= _near;
	m_Far	= _far;
	UpdateProj();
}

// -------------------------------------------------------------------------------
//		プロジェクション行列の再計算
// -------------------------------------------------------------------------------
void CameraBase::UpdateProj()
{

    m_Proj = DirectX::XMMatrixPerspectiveFovLH(
        DirectX::XMConvertToRadians(m_Fov),
        m_Aspect,
        m_Near,
        m_Far
    );
}
