#pragma once
// -------------------------------------------------------------------------------
// Includes
// -------------------------------------------------------------------------------
#include <Engine/Renderer/RendererItem/DebugLineDrawItem/DebugLineDrawItem.h>

// -------------------------------------------------------------------------------
// DebugLineResource class
// 
// 概要 : 
//	デバッグライン描画用の頂点バッファを管理する
// -------------------------------------------------------------------------------
class DebugLineResource
{
public:

	// -------------------------------------------------------------------------------
	// コンストラクタ
	// -------------------------------------------------------------------------------
	DebugLineResource();

	// -------------------------------------------------------------------------------
	// デストラクタ
	// -------------------------------------------------------------------------------
	~DebugLineResource();

	// -------------------------------------------------------------------------------
	// @brief	初期化（ResMeshからGPUリソースを生成）
	// 
	// @param[in]	_pDevice	デバイス
	// @param[in]	_resMesh	格納可能な最大頂点数
	// -------------------------------------------------------------------------------
	bool Init(ID3D12Device* _pDevice,uint32_t _frameCount, uint32_t _maxVertexCount);

	// -------------------------------------------------------------------------------
	// @brief	終了処理
	// -------------------------------------------------------------------------------
	void Term();

	// -------------------------------------------------------------------------------
	// 頂点データ更新
	// 
	// @param[in]	_pVertices	頂点データの先頭アドレス
	// @param[in]	_vertexCount	頂点数
	// -------------------------------------------------------------------------------
	bool UpdateVertexBuffer(uint32_t _frameIndex, const DebugLineVertex* _pVertices, uint32_t _vertexCount);

	// -------------------------------------------------------------------------------
	// 描画コマンドを積む
	// -------------------------------------------------------------------------------
	void Draw(ID3D12GraphicsCommandList* _pCmd, uint32_t _frameIndex);

private:

	// -------------------------------------------------------------------------------
	// 1フレーム分の頂点バッファ
	// -------------------------------------------------------------------------------
	struct FrameVertexBuffer
	{
		Microsoft::WRL::ComPtr<ID3D12Resource> Buffer;

		D3D12_VERTEX_BUFFER_VIEW VBV{};

		DebugLineVertex* pMappedData = nullptr;

		uint32_t VertexCount = 0;
	};

	// -------------------------------------------------------------------------------
	// @brief	バッファをUPLOADヒープに生成して初期データを書き込む
	// -------------------------------------------------------------------------------
	bool CreateVertexBuffer(ID3D12Device* _pDevice, FrameVertexBuffer& _frameBuffer);

private:

	std::vector<FrameVertexBuffer>	m_FrameBuffers;

	uint32_t						m_MaxVertexCount = 0;
};
