//#pragma once
//
//// -------------------------------------------------------------------------------
//// Includes
//// -------------------------------------------------------------------------------
//#include <Framework/Pool/DescriptorPool/DescriptorPool.h>
//#include <Framework/Texture/Texture.h>
//#include <Framework/Buffer/ConstantBuffer/ConstantBuffer.h>
//
//// -------------------------------------------------------------------------------
//// Material class
//// -------------------------------------------------------------------------------
//class Material
//{
//public:
//
//	// -------------------------------------------------------------------------------
//	// TEXXTURE_USAGE enum
//	// -------------------------------------------------------------------------------
//	enum TEXTURE_USAGE
//	{
//		TEXTURE_USAGE_DIFFUSE = 0,	// ディフューズマップとして利用
//		TEXTURE_USAGE_SPECULAR,		// スペキュラーマップとして利用
//		TEXTURE_USAGE_SHININESS,	// シャイネスマップとして利用
//		TEXTURE_USAGE_NORMAL,		// 法線マップとして利用
//		TEXTURE_USAGE_COUNT
//	};
//
//	// -------------------------------------------------------------------------------
//	// @brief	コンストラクタ
//	// -------------------------------------------------------------------------------
//	Material();
//
//	// -------------------------------------------------------------------------------
//	// @brief	デストラクタ
//	// -------------------------------------------------------------------------------
//	~Material();
//
//	// -------------------------------------------------------------------------------
//	// @brief	初期化処理
//	// @param[in]	pDevice		デバイス
//	// @param[in]	pPool		ディスクリプタプール（CBV_UAV_SRV用のものを設定）
//	// @param[in]	bufferSize	1マテリアルあたりの定数バッファのサイズ
//	// @param[in]	count		マテリアル数
//	// @retval	true	初期化に成功
//	// @retval	false	初期化に失敗
//	// -------------------------------------------------------------------------------
//	bool Init(
//		ID3D12Device*	_pDevice,
//		DescriptorPool* _pPool,
//		size_t			_bufferSize,
//		size_t			_count);
//
//	// -------------------------------------------------------------------------------
//	// @brief	終了処理を行う
//	// -------------------------------------------------------------------------------
//	void Term();
//
//	// -------------------------------------------------------------------------------
//	// @brief	テクスチャを設定
//	// 
//	// @param[in]	index	マテリアル番号
//	// @param[in]	usage	テクスチャの使用用途
//	// @param[in]	path	テクスチャパス
//	// @param[out]	batch	リソースアップロードバッチ
//	// @retval	treu	設定に成功
//	// @retval	false	設定に失敗
//	// -------------------------------------------------------------------------------
//	bool SetTexture(
//		size_t							_index,
//		TEXTURE_USAGE					_usage,
//		const std::wstring&				_path,
//		DirectX::ResourceUploadBatch&	_batch);
//
//	// -------------------------------------------------------------------------------
//	// @brief	定数バッファのポインタを取得
//	// 
//	// @param[in]	index	取得するマテリアル番号
//	// @return	指定された番号に一致する定数バッファのポインタを返却
//	//			一致するものがない場合はnullptrを返却
//	// -------------------------------------------------------------------------------
//	void* GetBufferPtr(size_t _index) const;
//
//	// -------------------------------------------------------------------------------
//	// @brief	定数バッファのポインタを取得
//	// 
//	// @param[in]	index	取得するマテリアル番号
//	// @return	指定された番号に一致する定数バッファのポインタを返却
//	//			一致するものがない場合はnullptrを返却
//	// -------------------------------------------------------------------------------
//	template<typename T>
//	T* GetBufferPtr(size_t _index) const 
//	{ return reinterpret_cast<T*>(GetBufferPtr(_index);) }
//
//	// -------------------------------------------------------------------------------
//	// @brief	定数バッファのGPU仮想アドレスを取得
//	// 
//	// @param[in]	index	取得するマテリアル番号
//	// @return	指定された番号に一致する定数バッファのGPU仮想アドレスを返却
//	// -------------------------------------------------------------------------------
//	D3D12_GPU_VIRTUAL_ADDRESS GetBufferAddress(size_t _index) const;
//
//	// -------------------------------------------------------------------------------
//	// @brief	テクスチャハンドルを取得
//	// 
//	// @param[in]	index	取得するマテリアル番号
//	// @param[in]	usage	取得するテクスチャの使用用途
//	// @return	指定された番号に一致するテクスチャのディスクリプタハンドルを返却
//	// -------------------------------------------------------------------------------
//	D3D12_GPU_DESCRIPTOR_HANDLE GetTextureHandle(size_t _index, TEXTURE_USAGE _usage) const;
//
//	// -------------------------------------------------------------------------------
//	// @brief	マテリアル数を取得
//	// 
//	// @return	マテリアル数を返却
//	// -------------------------------------------------------------------------------
//	size_t GetCount() const;
//
//private:
//
//	// -------------------------------------------------------------------------------
//	// Subset structure
//	// -------------------------------------------------------------------------------
//	struct Subset
//	{
//		ConstantBuffer*				pConstantBuffer;					// 定数バッファ
//		D3D12_GPU_DESCRIPTOR_HANDLE	TextureHandle[TEXTURE_USAGE_COUNT];	// テクスチャハンドル
//	};
//
//	// -------------------------------------------------------------------------------
//	// private variables
//	// -------------------------------------------------------------------------------
//	std::map<std::wstring, Texture*>	m_pTexture;	// テクスチャ
//	std::vector<Subset>					m_Subset;	// サブセット
//	ID3D12Device*						m_pDevice;	// デバイス
//	DescriptorPool*						m_pPool;	// ディスクリプタプール
//
//	// -------------------------------------------------------------------------------
//	// private methods
//	// -------------------------------------------------------------------------------
//	Material		(const Material&) = delete;
//	void operator = (const Material&) = delete;
//};
//
//constexpr auto TU_DIFFUSE	= Material::TEXTURE_USAGE_DIFFUSE;
//constexpr auto TU_SPECULAR	= Material::TEXTURE_USAGE_SPECULAR;
//constexpr auto TU_SHININESS = Material::TEXTURE_USAGE_SHININESS;
//constexpr auto TU_NORMAL	= Material::TEXTURE_USAGE_NORMAL;
